app/views/messages/threads.html.erb


        <%the_message = Message.where({ :id => a_message.id }).at(0)%>
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ?  [["id", 14]]

        <%the_message.read = true%>
        <%the_message.save%>
---
UPDATE "messages" SET "read" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["read", 1], ["updated_at", "2022-03-04 17:59:04.351626"], ["id", 18]]