app/controllers/acquisition_criteria_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."sender_id" = ? AND "messages"."acquisition_id" = ?  [["sender_id", 3], ["acquisition_id", 3]]
INSERT INTO "views" ("id_acquisition", "id_viewer", "clicked", "potential_lead", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id_acquisition", 3], ["id_viewer", 3], ["clicked", 1], ["potential_lead", 0], ["created_at", "2022-03-04 18:39:01.262489"], ["updated_at", "2022-03-04 18:39:01.262489"]]
---
  def show

    #already a connection?
    id_acquisition = params.fetch("path_id")

    matching_messages = Message.where(sender_id: session.fetch(:user_id)).where({:acquisition_id => id_acquisition})

    @list_of_messages = matching_messages


    #log a user clicking the link
    the_view = View.new
    the_view.id_acquisition = params.fetch("path_id")
    the_view.id_viewer = session.fetch(:user_id)
    the_view.clicked = true
    the_view.potential_lead = false

    if the_view.valid?
      the_view.save