app/controllers/application_controller.rb

  def load_current_user
    the_id = session[:user_id]
    @current_user = User.where({ :id => the_id }).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]