app/controllers/messages_controller.rb

  def index

    @list_of_acquisition_criteria = AcquisitionCriterium.all
    @list_of_users = User.all
    @list_of_messages = Message.all

    matching_messages = Message.where(sender_id: session.fetch(:user_id)).or(Message.where(recipient_id: session.fetch(:user_id))).order({ :created_at => :desc })

    if matching_messages != nil
      #@list_of_threads = matching_messages.distinct.pluck(:acquisition_id, :sender_id, :recipient_id)
      @list_of_threads = matching_messages.pluck(:acquisition_id, :sender_id, :recipient_id).uniq
---
SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC
SELECT "messages".* FROM "messages" WHERE ("messages"."sender_id" = ? OR "messages"."recipient_id" = ?) ORDER BY "messages"."created_at" DESC  [["sender_id", 1], ["recipient_id", 1]]
SELECT "messages"."acquisition_id", "messages"."sender_id", "messages"."recipient_id" FROM "messages" WHERE ("messages"."sender_id" = ? OR "messages"."recipient_id" = ?) ORDER BY "messages"."created_at" DESC  [["sender_id", 1], ["recipient_id", 1]]

  def conversations
    id_sender = params.fetch("sender_id")
    id_acquisition = params.fetch("criteria_id")

    matching_messages = Message.where(sender_id: id_sender).or(Message.where(recipient_id: id_sender)).where({:acquisition_id => id_acquisition})
    matching_messages = matching_messages.where(sender_id: session.fetch(:user_id)).or(Message.where(recipient_id: session.fetch(:user_id))).where({:acquisition_id => id_acquisition})

    @list_of_messages = matching_messages.order({ :created_at => :desc })
---
SELECT "messages"."acquisition_id", "messages"."sender_id", "messages"."recipient_id" FROM "messages" WHERE ("messages"."sender_id" = ? OR "messages"."recipient_id" = ?) ORDER BY "messages"."created_at" DESC  [["sender_id", 1], ["recipient_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."sender_id" = ? AND "messages"."recipient_id" = ? AND "messages"."acquisition_id" = ?  [["sender_id", 3], ["recipient_id", 1], ["acquisition_id", 1]]

  def show
    the_id = params.fetch("path_id")

    matching_messages = Message.where({ :id => the_id })
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ?  [["id", 2]]

  def create

    the_message = Message.new
    the_message.sender_id = session.fetch(:user_id)
    the_message.recipient_id = params.fetch("rec_id")
    the_message.content = params.fetch("query_content")
    the_message.read = false
    the_message.acquisition_id = params.fetch("a_id")

    if the_message.valid?
      the_message.save
---
INSERT INTO "messages" ("sender_id", "recipient_id", "content", "read", "acquisition_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["sender_id", 1], ["recipient_id", 1], ["content", "no way dude!"], ["read", 0], ["acquisition_id", 1], ["created_at", "2022-03-04 01:13:56.264900"], ["updated_at", "2022-03-04 01:13:56.264900"]]

  def createThread

    the_message = Message.new
    the_message.sender_id = session.fetch(:user_id)
    the_message.recipient_id = params.fetch("rec_id")
    the_message.content = params.fetch("query_content")
    the_message.read = false
    the_message.acquisition_id = params.fetch("a_id")

    if the_message.valid?
      the_message.save
---
INSERT INTO "messages" ("sender_id", "recipient_id", "content", "read", "acquisition_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["sender_id", 1], ["recipient_id", 2], ["content", "hey"], ["read", 0], ["acquisition_id", 3], ["created_at", "2022-03-05 17:52:53.881213"], ["updated_at", "2022-03-05 17:52:53.881213"]]

  def update
    the_id = params.fetch("path_id")
    the_message = Message.where({ :id => the_id }).at(0)
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ?  [["id", 6]]

  def destroy
    the_id = params.fetch("path_id")
    the_message = Message.where({ :id => the_id }).at(0)

    the_message.destroy
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ?  [["id", 6]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 6]]