app/controllers/user_authentication_controller.rb

  def create_cookie
    user = User.where({ :email => params.fetch("query_email") }).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "karam@gmail.com"], ["LIMIT", 1]]

  def create
    @user = User.new
    @user.email = params.fetch("query_email")
    @user.password = params.fetch("query_password")
    @user.password_confirmation = params.fetch("query_password_confirmation")
    @user.name = params.fetch("query_name")
    @user.company_name = params.fetch("query_company_name")
    @user.phone_number = params.fetch("query_phone_number")
    @user.role = params.fetch("query_role")

    save_status = @user.save
---
INSERT INTO "users" ("email", "password_digest", "name", "company_name", "phone_number", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = @current_user
    @user.email = params.fetch("query_email")
    @user.password = params.fetch("query_password")
    @user.password_confirmation = params.fetch("query_password_confirmation")
    @user.name = params.fetch("query_name")
    @user.company_name = params.fetch("query_company_name")
    @user.phone_number = params.fetch("query_phone_number")
    @user.role = params.fetch("query_role")

    if @user.valid?
      @user.save
---
UPDATE "users" SET "name" = ?, "company_name" = ?, "phone_number" = ?, "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Joe Karam2"], ["company_name", "Mike2"], ["phone_number", "65139952392"], ["role", "boss2"], ["updated_at", "2022-03-09 01:38:14.029910"], ["id", 1]]